NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_wificore.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf7120_enga_wificore</name>
  <series>nrf71</series>
  <version>1</version>
  <description>System-on-chip with a 32-bit Arm Cortex-M33 microcontroller</description>
  <licenseText>
Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
      </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <peripherals>
    <peripheral>
      <name>GLOBAL_WICR</name>
      <description>Wi-Fi Information Configuration Registers</description>
      <baseAddress>0x003FD000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>WICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>MAC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>WICR_MAC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>ADDRESS0</name>
            <description>Description cluster: MAC address for VIFn</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>B6</name>
                <description>6th byte (B6) of MAC address</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>B5</name>
                <description>5th byte (B5) of MAC address</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>B4</name>
                <description>4th byte (B4) of MAC address</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>B3</name>
                <description>3rd byte (B3) of MAC address</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDRESS1</name>
            <description>Description cluster: MAC address for VIFn</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>B2</name>
                <description>2nd byte (B2) of MAC address</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>B1</name>
                <description>1st byte (B1) of MAC address</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CALIB</name>
          <description>Unspecified</description>
          <headerStructName>WICR_CALIB</headerStructName>
          <access>read-write</access>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>XO</name>
            <description>XO adjustment</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>XO</name>
                <description>XO adjustment</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXPOW5G0MCS7</name>
            <description>Max output power for MCS7</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOW</name>
                <description>Max output power for MCS7 in low 5GHz sub-band (channels 36 - 64)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MID</name>
                <description>Max output power for MCS7 in mid 5GHz sub-band (channels 100 - 132)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HIGH</name>
                <description>Max output power for MCS7 in high 5GHz sub-band (channels 136 - 177)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXPOW5G0MCS0</name>
            <description>Max output power for MCS0</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOW</name>
                <description>Max output power for MCS0 in low 5GHz sub-band (channels 36 - 64)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>MID</name>
                <description>Max output power for MCS0 in mid 5GHz sub-band (channels 100 - 132)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HIGH</name>
                <description>Max output power for MCS0 in high 5GHz sub-band (channels 136 - 177)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
