NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_SICR</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FFE000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>SICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_CRACENCORE</name>
      <description>CRACENCORE</description>
      <baseAddress>0x50010000</baseAddress>
      <!--Security dma=NSA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CRACENCORE</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>CRYPTMSTRDMA</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_CRYPTMSTRDMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>FETCHADDRLSB</name>
            <description>Fetch Address Least Significant Word</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHADDRLSB</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FETCHADDRMSB</name>
            <description>Fetch Address Most Significant Word</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHADDRMSB</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FETCHLEN</name>
            <description>Fetch DMA Length (only used in direct mode)</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHLEN</name>
                <description>Length of data block</description>
                <lsb>0</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>FETCHCSTADDR</name>
                <description>Constant address</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>FETCHREALIGN</name>
                <description>Realign length</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FETCHZPADDING</name>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FETCHTAG</name>
            <description>Fetch User Tag (only used in direct mode)</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHTAG</name>
                <description>User tag</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUSHADDRLSB</name>
            <description>Push Address Least Significant Word</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PUSHADDRLSB</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUSHADDRMSB</name>
            <description>Push Address Most Significant Word</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PUSHADDRMSB</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PUSHLEN</name>
            <description>Push Length (only used in direct mode)</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PUSHLEN</name>
                <description>Length of data block</description>
                <lsb>0</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>PUSHCSTADDR</name>
                <description>Constant address</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>PUSHREALIGN</name>
                <description>Realign length</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>PUSHDISCARD</name>
                <description>Discard data</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTEN</name>
            <description>Interrupt Enable mask</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHERBLOCKEND</name>
                <description>Fetcher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FETCHERSTOPPED</name>
                <description>Fetcher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHERERROR</name>
                <description>Bus error during fetcher DMA access</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHERBLOCKEND</name>
                <description>Pusher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PUSHERSTOPPED</name>
                <description>Pusher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PUSHERERROR</name>
                <description>Bus error during pusher DMA access</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTENSET</name>
            <description>Interrupt Set</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHERBLOCKEND</name>
                <description>Fetcher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FETCHERSTOPPED</name>
                <description>Fetcher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHERERROR</name>
                <description>Bus error during fetcher DMA access</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHERBLOCKEND</name>
                <description>Pusher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PUSHERSTOPPED</name>
                <description>Pusher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PUSHERERROR</name>
                <description>Bus error during pusher DMA access</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTENCLR</name>
            <description>Interrupt Clear</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHERBLOCKEND</name>
                <description>Fetcher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FETCHERSTOPPED</name>
                <description>Fetcher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHERERROR</name>
                <description>Bus error during fetcher DMA access</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHERBLOCKEND</name>
                <description>Pusher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PUSHERSTOPPED</name>
                <description>Pusher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PUSHERERROR</name>
                <description>Bus error during pusher DMA access</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTATRAW</name>
            <description>Interrupt Status Raw</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHERBLOCKEND</name>
                <description>Fetcher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FETCHERSTOPPED</name>
                <description>Fetcher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHERERROR</name>
                <description>Bus error during fetcher DMA access</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHERBLOCKEND</name>
                <description>Pusher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PUSHERSTOPPED</name>
                <description>Pusher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PUSHERERROR</name>
                <description>Bus error during pusher DMA access</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTAT</name>
            <description>Interrupt Status</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHERBLOCKEND</name>
                <description>Fetcher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FETCHERSTOPPED</name>
                <description>Fetcher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHERERROR</name>
                <description>Bus error during fetcher DMA access</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHERBLOCKEND</name>
                <description>Pusher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PUSHERSTOPPED</name>
                <description>Pusher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PUSHERERROR</name>
                <description>Bus error during pusher DMA access</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTSTATCLR</name>
            <description>Interrupt Status Clear</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHERBLOCKEND</name>
                <description>Fetcher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>FETCHERSTOPPED</name>
                <description>Fetcher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHERERROR</name>
                <description>Bus error during fetcher DMA access</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHERBLOCKEND</name>
                <description>Pusher DMA reached the end of a block (if enabled in the descriptor; scatter-gather only)</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PUSHERSTOPPED</name>
                <description>Pusher DMA reached the end of a block with Stop=1, or end of direct transfer</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PUSHERERROR</name>
                <description>Bus error during pusher DMA access</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Cryptomaster configuration</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHCTRLINDIRECT</name>
                <description>Fetcher scatter/gather.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PUSHCTRLINDIRECT</name>
                <description>Pusher scatter/gather.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>FETCHSTOP</name>
                <description>Stop fetcher.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PUSHSTOP</name>
                <description>Stop pusher DMA.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>SOFTRST</name>
                <description>Soft reset the cryptomaster.</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>START</name>
            <description>Start</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTFETCH</name>
                <description>Writing a '1' starts the fetcher DMA. Writing a '0' has no effect.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>STARTPUSH</name>
                <description>Writing a '1' starts the pusher DMA. Writing a '0' has no effect.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FETCHBUSY</name>
                <description>This bit is high as long as the fetcher DMA is busy.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PUSHBUSY</name>
                <description>This bit is high as long as the pusher DMA is busy.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FETCHNOTEMPTY</name>
                <description>Not empty flag for fetcher DMA input FIFO</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PUSHWAITINGFIFO</name>
                <description>Pusher DMA Waiting FIFO. This bit is high when the pusher is waiting for more data in output FIFO.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SOFTRSTBUSY</name>
                <description>This bit is high when the soft reset is on going</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PUSHNBDATA</name>
                <description>Amount of data in the pusher DMA output FIFO</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
