NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ANTSWC</name>
      <description>Antenna switch controller</description>
      <baseAddress>0x4800D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ANTSWC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>ERRORSTATUS</name>
          <description>Unspecified</description>
          <headerStructName>ANTSWC_ERRORSTATUS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>TX</name>
            <description>Concurrent TX error condition</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Count of concurrent TX error conditions detected</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRORACTIVE</name>
                <description>Concurrent TX error condition is active</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXRX</name>
            <description>Concurrent TX-RX error condition</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNT</name>
                <description>Count of concurrent TX-RX error conditions detected</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRORACTIVE</name>
                <description>Concurrent TX-RX error condition is active</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ERRORPORT</name>
            <description>Indicates which ports are in error</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORPORT</name>
                <description>Bitfield indicating the ports in error during the last error condition.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CONFIG</name>
          <description>Antenna switch controller enable / software reset</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLEPKTACTIVE_0</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_1</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_2</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_3</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_4</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_5</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_6</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEPKTACTIVE_7</name>
              <description>Bitfield indicating whether ANTSWC listens to PktActive on radio port i.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ignore</name>
                  <description>Ignore PktActive on the corresponding radio port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Respect</name>
                  <description>Use PktActive on the corresponding radio port for antenna switch selection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable antenna switch module.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Antenna Switch Controller disabled - all outputs held low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Antenna Switch Controller enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INHIBIT</name>
          <description>Inhibit register</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INHIBIT_0</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INHIBIT_1</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INHIBIT_2</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INHIBIT_3</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INHIBIT_4</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INHIBIT_5</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INHIBIT_6</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INHIBIT_7</name>
              <description>Bitfield of 8 separate bits indicating whether connection of the antenna to radio on radio port i is enabled or inhibited.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inhibit</name>
                  <description>Inhibit connection of antenna to the corresponding radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable antenna to be connected to the corresponding radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
